from nonebot import on_command

add_cost = on_command("添加班费", aliases={"添加班费记录", "添加账单"}, priority=100, block=True)
show_cost = on_command("查询班费", aliases={"查看班费", "班费记录", "查看账单", "查询账单"}, priority=100, block=True)
export_cost = on_command("导出班费", aliases={"导出班费记录", "导出账单"}, priority=100, block=True)


__helper__ = [{
    "cmd": "添加班费",
    "alias": ["添加班费记录", "添加账单"],
    "params": ["费用说明", "金额(扣款用-)", "班级名称（教师参数）"],
    "use": [["添加班费 班级缴费 100", "[图片]"], ["添加班费 打印纸费用 -100", "[图片]"]],
    "doc": "学生和教师都可以添加班费，（如果是扣款请使用减号，比如：-100） 来表示扣款。",
    "tags": ["添加", "班费", "账单", "学生", "教师"]
}, {
    "cmd": "查询班费",
    "alias": ["查看班费", "班费记录", "查看账单", "查询账单"],
    "params": ["日期", "班级名称（教师参数）"],
    "doc": "学生和教师都可以查看班费，班级名称不能和时间写在一起",
    "tags": ["查询", "班费", "账单", "学生", "教师"],
    "use": [["查询班费 2023 1", "[图片]"], ["查询班费 2023 1", "查询哪个班级呢？"], ["人工智能2101", "图片"]]
}, {
    "cmd": "导出班费",
    "alias": ["导出班费记录", "导出账单"],
    "params": ["日期", "班级名称（教师参数）"],
    "doc": "学生和教师都可以导出班费，班级名称不能和时间写在一起",
    "tags": ["导出", "班费", "账单", "学生", "教师"],
    "use": [["导出班费 2023 1", "[excel表格]"], ["导出班费 2023 1", "导出哪个班级呢？"], ["人工智能2101", "excel表格"]]
}]