from nonebot import on_command


add_moral = on_command("德育", aliases={"添加德育"}, priority=100, block=True)
export_moral = on_command("导出德育", priority=100, block=True)
export_moral_images = on_command("导入德育截图", aliases={"导出德育图片"}, priority=100, block=True)



__helper__ = [{
    "cmd": "德育",
    "alias": ["添加德育"],
    "params": ["学生姓名（班干部使用）", "说明事件", "证明图片"],
    "tags": ["添加", "德育", "学生"],
    "use": [
        ["德育", "说明一下是什么事情吧"], 
        ["参加学校活动 [图片]", "OK"], 
        [["如果你是干部，可以为另外的同学添加", "德育 张同学 李同学"], "说明一下什么事情吧！"], 
        ["参加学校活动 [图片]", "OK"]
    ],
    "doc": "德育功能只有学生可以使用，如果你是班干部的话可以为另外的同学添加德育，为其它学生添加德育动用的是查找的方式添加",
}, {
    "cmd": "导出德育",
    "params": ["导出的年月日（不填写表示本月）", "班级名字（教师才需要填写）"],
    "tags": ["导出", "德育", "学生", "教师"],
    "use": [
        ["导出德育", "[文件.xlsx]"],
        [["如果你是教师的情况下", "导出德育"], '选择班级[列表]'],
        ["人工智能2101", "[文件.xlsx]"],
        [["您可以指定导出的年月日", "导出德育 12"], "[今年12月文件.xlsx]"]
    ],
    "doc": "教师和学生都可以导出，也可以指定年月日，比如2023 12表示年月，2023 12 12表示指定日子"
}]
